app/controllers/abilities_controller.rb

SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'Автоцивілка' LIMIT 1
INSERT INTO "abilities" ("category_id", "created_at", "insurance_id", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["created_at", "2015-02-14 02:14:33.685415"], ["insurance_id", 1], ["updated_at", "2015-02-14 02:14:33.685415"]]
---
  def create
    @category = Category.find_by name: params[:category_name]
    @ability = Ability.new({:category_id => @category.id, :insurance_id => params[:insurance_id]})
    if @ability.save