app/controllers/categories_controller.rb

  def create
    @category = Category.new category_safe_params
    if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-02-14 01:57:10.003294"], ["name", "Автоцивілка"], ["updated_at", "2015-02-14 01:57:10.003294"]]