app/controllers/clients_controller.rb

	def create
		@client = Client.new client_params
		@client.user_id = self.current_user.id
		if @client.save
---
INSERT INTO "clients" ("created_at", "identification_number", "middle_name", "name", "passport", "surname", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)