app/controllers/clients_controller.rb

	def user_clients
		# Client.find_by user_id: current_user.id
		@clients = Client.where(user_id: current_user.id).all
---
SELECT "clients".* FROM "clients"  WHERE "clients"."user_id" = 1