app/controllers/insurances_controller.rb

SELECT "insurances".* FROM "insurances"
---
  def index
    @insurances = Insurance.all

INSERT INTO "insurances" ("created_at", "link", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-14 00:53:55.889132"], ["link", "www.google.com"], ["name", "Jupiter"], ["updated_at", "2015-02-14 00:53:55.889132"]]
---
  def create
    @insurance = Insurance.new insurance_secure_params
    if @insurance.save

DELETE FROM "insurances" WHERE "insurances"."id" = ?  [["id", 6]]
---
  def destroy
    @insurance.destroy

SELECT  "insurances".* FROM "insurances"  WHERE "insurances"."id" = ? LIMIT 1  [["id", 6]]
---
  def set_insurance
    @insurance = Insurance.find(params[:id])