app/controllers/users_controller.rb

  def update
    set_user
    authorize @user
    if @user.update (user_secure_params)
---
UPDATE "users" SET "status" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["status", 1], ["updated_at", "2015-02-18 15:47:41.738845"]]